In [14]:
import pandas as pd
# importa pandas
df = pd.read_csv("https://raw.githubusercontent.com/guilhermeonrails/data-jobs/refs/heads/main/salaries.csv")
#pega a base de dados

In [23]:
df.head()
# visualiza os 5 primeiros
df.head(20)
# visualiza os 20 primeiros
df.tail(10)
# visualiza os 10 últimos
df.tail(2)
#visualiza os 2 últimos

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
133347,2020.0,EN,CT,Business Data Analyst,100000,USD,100000,US,100,US,L
133348,2021.0,SE,FT,Data Scientist,7000000,INR,94665,IN,50,IN,L

In [31]:
df.info()
#verifica os tipos dos dados

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 133349 entries, 0 to 133348
Data columns (total 11 columns):
 #   Column              Non-Null Count   Dtype
---  ------              --------------   -----
 0   work_year           133339 non-null  float64
 1   experience_level    133349 non-null  object
 2   employment_type     133349 non-null  object
 3   job_title           133349 non-null  object
 4   salary              133349 non-null  int64
 5   salary_currency     133349 non-null  object
 6   salary_in_usd       133349 non-null  int64
 7   employee_residence  133349 non-null  object
 8   remote_ratio        133349 non-null  int64
 9   company_location    133349 non-null  object
 10  company_size        133349 non-null  object
dtypes: float64(1), int64(3), object(7)
memory usage: 11.2+ MB

In [33]:
df.describe()
# descricao mais aprofundada das informações
# count: número de valores não nulos
# mean: média
# std: desvio padrão
# min: valor mínimo
# 25%: primeiro quartil (Q1)
# 50%: mediana (Q2)
# 75%: terceiro quartil (Q3)
# max: valor máximo

           work_year        salary  salary_in_usd   remote_ratio
count  133339.000000  1.333490e+05  133349.000000  133349.000000
mean     2024.358770  1.632833e+05  157617.272098      20.905669
std         0.680627  2.173860e+05   74288.363097      40.590044
min      2020.000000  1.400000e+04   15000.000000       0.000000
25%      2024.000000  1.060200e+05  106000.000000       0.000000
50%      2024.000000  1.470000e+05  146206.000000       0.000000
75%      2025.000000  1.990000e+05  198000.000000       0.000000
max      2025.000000  3.040000e+07  800000.000000     100.000000

In [36]:
df['work_year'].std()
# Desvio padrão baixo (como 0.68) = dados próximos entre si.
# Desvio padrão alto (ex: 10, 50...) = dados mais espalhados.

0.6806266087844866

In [39]:
df.shape
# número de linhas x colunas

(133349, 11)

In [44]:
linhas, colunas = df.shape[0],df.shape[1]
# criando variaveis linhas e colunas para pegarmos os valores da posicao 0 e 1 
linhas
# verificando o valor de linhas

133349

In [47]:
colunas
# verificando o valor de colunas
print('Colunas - ',colunas)

Colunas -  11

In [49]:
# verificando o valor de linhas
print('Linhas - ',linhas)

Linhas -  133349

In [52]:
df.columns
# pega o nome de colunas

Index(['work_year', 'experience_level', 'employment_type', 'job_title',
       'salary', 'salary_currency', 'salary_in_usd', 'employee_residence',
       'remote_ratio', 'company_location', 'company_size'],
      dtype='object')

In [54]:
# Dicionário, renomeando as colunas com novos nomes em portugues
novos_nomes = {
    'work_year': 'ano',
    'experience_level': 'senioridade',
    'employment_type': 'contrato',
    'job_title': 'cargo',
    'salary': 'salario',
    'salary_currency': 'moeda',
    'salary_in_usd': 'usd',
    'employee_residence': 'residencia',
    'remote_ratio': 'remoto',
    'company_location': 'empresa',
    'company_size': 'tamanho_empresa'
}

# Aplicando renomeação
df.rename(columns=novos_nomes, inplace=True)

# Verificando resultado
df.head()

,ano,senioridade,contrato,cargo,salario,moeda,usd,residencia,remoto,empresa,tamanho_empresa
0,2025.0,SE,FT,Solutions Engineer,214000,USD,214000,US,100,US,M
1,2025.0,SE,FT,Solutions Engineer,136000,USD,136000,US,100,US,M
2,2025.0,MI,FT,Data Engineer,158800,USD,158800,AU,0,AU,M
3,2025.0,MI,FT,Data Engineer,139200,USD,139200,AU,0,AU,M
4,2025.0,EN,FT,Data Engineer,90000,USD,90000,US,0,US,M

In [57]:
#Qual a frequencia de categoria de cada coluna
# O método .value_counts() serve para contar quantas vezes cada valor único aparece em uma coluna.
df["senioridade"].value_counts()
#SENIOR / MID / ENTRY / EXECUTIVE

SE    77241
MI    40465
EN    12443
EX     3200
Name: senioridade, dtype: int64

In [60]:
#Analisar tipo do emprego/contrato
df['contrato'].value_counts()
#FULL TIME / CONTRACT / PART TIME / FREELANCER

FT    132563
CT       394
PT       376
FL        16
Name: contrato, dtype: int64

In [62]:
#Analisar modelo de trabalho remoto
df['remoto'].value_counts()
# 0 -- Presenciais
# 100 -- Remotos
# 50  -- Hibridos

0      105312
100     27718
50        319
Name: remoto, dtype: int64

In [64]:
#Tamanho da empresa
df['tamanho_empresa'].value_counts()

M    129561
L      3574
S       214
Name: tamanho_empresa, dtype: int64

In [70]:
#Substituir siglas de Senioridade
substitui_senior = {
    'SE': 'Senior',
    'MI': 'Pleno',
    'EN': 'Junior',
    'EX': 'Executivo'
}

#usa o map para modificar 
df['senioridade']= df['senioridade'].replace(substitui_senior)

In [72]:
df['senioridade'].value_counts()

Senior       77241
Pleno        40465
Junior       12443
Executivo     3200
Name: senioridade, dtype: int64

In [78]:
#Substituir siglas de Contrato
contrato_novo = {
    'FT': 'Tempo Integral',
    'PT': 'Tempo Parcial',
    'FL': 'Freelancer',
    'CT': 'Contrato'
}

#usa o map para modificar 
df['contrato']= df['contrato'].replace(contrato_novo)

In [80]:
df['contrato'].value_counts()

Tempo Integral    132563
Contrato             394
Tempo Parcial        376
Freela                16
Name: contrato, dtype: int64

In [82]:
df.describe(include='object')
#Count = contagem
#unique = dados unicos
# top = informações mais frequentes
# freq = calculo da frequencia - quantas vezes se repete a info

,senioridade,contrato,cargo,moeda,residencia,empresa,tamanho_empresa
count,133349,133349,133349,133349,133349,133349,133349
unique,4,4,390,26,102,95,3
top,Senior,Tempo Integral,Data Scientist,USD,US,US,M
freq,77241,132563,17314,126140,119579,119641,129561